Процедура Инициализировать(Объект, ИмяТабличнойЧасти, ТабличноеПолеОбъекта) Экспорт

	ТекФорма = ПолучитьФорму("Форма");
	ТекФорма.ДокОбъект = Объект;
	ТекФорма.ССылкаНаОбъект = Объект.ссылка;
	ТекФорма.Открыть();
	
КонецПроцедуры

Функция ПолучитьSQLид(сс)
	
	
	п = СокрЛП(сс.УникальныйИдентификатор());
	Стр = "0x" + Сред(п,20,4) + Сред(п,25,12) + Сред(п,15,4) + Сред(п,10,4) + Сред(п,1,8);
	
	//стрГУИД = Сред(Стр,25,8)+"-"+Сред(Стр,21,4)+"-"+Сред(Стр,17,4)+"-"+Сред(Стр,1,4)+"-"+Сред(Стр,5,12);
	Возврат Стр;
	
КонецФункции

Функция ПолучитьКА(СтрОЛЕ,ВсеДоки=0)
	
	
	сс = глГУИД.ПолучитьСсылкуПоИдSQL(СтрОЛЕ,"Контрагенты");
	Если ДокОбъект <> Неопределено
	   И сс <> ДокОбъект.Контрагент 
	   И ВсеДоки<>1 Тогда  
		
		Предупреждение("Загружен реестр контрагента "+сс+"
		| в реализацию "+СсылкаНаОбъект);
	КонецЕСЛИ;
	
	Возврат сс;
	
КонецФункции

Функция ПолучитьМст(СтрОЛЕ,Имя,ТекНОмГруппа)
	
	Стр = Сред(СтрОЛЕ,3);
	Если СокрЛП(Стр)="" ТОгда Возврат ТекНОмГруппа; КонецЕСЛИ;
	
	стрГУИД = Сред(Стр,25,8)+"-"+Сред(Стр,21,4)+"-"+Сред(Стр,17,4)+"-"+Сред(Стр,1,4)+"-"+Сред(Стр,5,12);
	//Сообщить(стрГУИД);
	ГУИД = Новый УникальныйИдентификатор(стрГУИД);
	сс = Справочники.НоменклатурныеГруппы.ПолучитьСсылку(ГУИД);
	
	Если Найти(СокрЛП(сс),"Объект не найден")=0  ТОгда
		Возврат сс;
	КонецЕСЛИ;
	
	Обк = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
	обк.УстановитьСсылкуНового(Справочники.НоменклатурныеГруппы.ПолучитьСсылку(ГУИД));
	Обк.Наименование = Имя;
	Обк.Родитель = Справочники.НоменклатурныеГруппы.НайтиПоКоду("000000002");
	Сообщить("Записано новое месторождение "+Обк);
	Обк.Записать();
	
	Возврат Обк.Ссылка;
	
КонецФункции

Процедура Данные(ТекНом,ДатаДОк,Тбл) Экспорт 
	
	ТекНоменклатура = Константы.ксНоменклатураТранспортныеУслуги.Получить();
	Если ЗначениеЗаполнено( ТекНоменклатура) = Ложь ТОгда
		ТекНоменклатура = Справочники.Номенклатура.НайтиПоКоду("000");
		Константы.ксНоменклатураТранспортныеУслуги.Установить(ТекНоменклатура);
	КонецЕСЛИ;
    ТекНОмГруппа = ТекНоменклатура.НоменклатурнаяГруппа;
	
	ТекНом = СокрЛП(ТекНом);
	Если ТекНом = "" Тогда ВозвраТ; КонецеСЛИ;
	
	
	ВсеДоки = 0;
	Если ТекНом = "ВсеДоки" ТОгда
		ВсеДоки = 1;
	КонецеСЛи;
	
	идНашКА = ПолучитьSQLид(Константы.ксКонтрагентНашаОрганизация.Получить());
	
	
	ДБ = Константы.ксБазаПЛ.Получить();
	
	СпрТС    = ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("Справочник.уатТС").Код;
	тсГарНом = Справочники.SQLтаблицы.НайтиПоНаименованию("Справочник.уатТС.ГаражныйНомер").Код;
	тсТип = Справочники.SQLтаблицы.НайтиПоНаименованию("Справочник.уатТС.ТипТС").Код+"RRef";
	
	СпрЦО = ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("Справочник.ЦехаКонтрагента").Код;
	цоМст = Справочники.SQLтаблицы.НайтиПоНаименованию("Справочник.ЦехаКонтрагента.Месторождение").Код+"RRef";
	цоНом = Справочники.SQLтаблицы.НайтиПоНаименованию("Справочник.ЦехаКонтрагента.НоменклатураДляБухгалтерии").Код+"RRef";
	цоДоп = Справочники.SQLтаблицы.НайтиПоНаименованию("Справочник.ЦехаКонтрагента.Доп").Код;
	
	СпрМст = ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("Справочник.Месторождения").Код;
	СпрПодр = ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("Справочник.ПодразделенияОрганизаций").Код;
	
	
	ДокРем  =  ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.уатРемонтныйЛист").Код; 
	РемИдРеф=  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.уатРемонтныйЛист").Код+"_IDRRef";
	дкНач =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.уатРемонтныйЛист.ДатаНачала").Код;
	
	Док  =  ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг").Код; 
	дкДт =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Дата").Код;
	дкКА =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Контрагент").Код+"RRef";
	дкЦех=  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.ЦО").Код+"RRef";
	
	ДокТЧ =  ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги").Код; 
	ДокТЧидРеф =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг").Код+"_IDRRef"; 
	//_ДокТЧ=  "_Document5073"; 
	дкТС  =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.ТС").Код+"RRef";
	дкЦО  =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.ЦехКонтрагента").Код+"RRef";
	дкПЛ    = Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.ПутевойЛист").Код+"RRef";
	дкКм  =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Пробег").Код;
	дкСум1   =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Сумма1").Код;
	дкСум2   =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Сумма2").Код;
	дкСум3   =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Сумма3").Код;
	дкСум4   =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Сумма4").Код;
	дкСум5   =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Сумма5").Код;
	дкСум6   =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Сумма6").Код;
	дкСум    = Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Сумма").Код;
	дкСумКм  = Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.СуммаКм").Код;
	//дкПЛ   = "_Fld5081RRef";
	дкКол   =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Количество").Код;
	дкКолКм =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.КоличествоКм").Код;
	дкКол1 =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Количество1").Код;
	дкКол2 =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Количество2").Код;
	дкКол3 =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Количество3").Код;
	дкКол4 =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Количество4").Код;
	дкКол5 =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Количество5").Код;
	дкКол6 =  Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.РеестрУслуг.Услуги.Количество6").Код;
	
	ДокПл  = ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.уатПутевойЛист").Код;
	плВзд  = Справочники.SQLтаблицы.НайтиПоНаименованию("Документ.уатПутевойЛист.ДатаВыезда").Код;
	
	РегПодр = ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("РегистрСведений.уатМестонахождениеТС").Код;
	ргТС    = Справочники.SQLтаблицы.НайтиПоНаименованию("РегистрСведений.уатМестонахождениеТС.ТС").Код+"RRef";
	ргПодр  = Справочники.SQLтаблицы.НайтиПоНаименованию("РегистрСведений.уатМестонахождениеТС.Подразделение").Код+"RRef";
	
	РегДопАн = ДБ+Справочники.SQLтаблицы.НайтиПоНаименованию("РегистрСведений.ДопАналитикаПоТСдляКонтрагента").Код;
	анКА     = Справочники.SQLтаблицы.НайтиПоНаименованию("РегистрСведений.ДопАналитикаПоТСдляКонтрагента.Контрагент").Код+"RRef";
	анМод    = Справочники.SQLтаблицы.НайтиПоНаименованию("РегистрСведений.ДопАналитикаПоТСдляКонтрагента.Модель").Код+"_RRRef";
	анЗн2    = Справочники.SQLтаблицы.НайтиПоНаименованию("РегистрСведений.ДопАналитикаПоТСдляКонтрагента.Зн2").Код;
	
	НачДт = НачалоМЕсяца(ДатаДок);
	КонДт = КонецМесяца(ДатаДок)  + 1;
	
	//НачДт = НачалоМЕсяца(СсылкаНаОбъект.Дата) - 1;
	//КонДт = КонецМесяца(СсылкаНаОбъект.Дата)  + 1;
	
	
	ТекстЗапроса = "
	| SELECT
	|   master.dbo.fn_sqlvarbasetostr(Док._IDRRef) Ид,
	|  	master.dbo.fn_sqlvarbasetostr("+дкКА+") идКА,
	|   LTRIM(RTRIM(Док._Number)) Ном,
	|   Док._Date_Time Дт,
	|  	СпрТС."+тсГарНом+" кодТС,
	|  	СпрТС._Description ИмяТС,
	|   СпрПодр._CODE КодПодр,
	|   master.dbo.fn_sqlvarbasetostr(СпрПодр._IDRRef)      Подр,
	|   master.dbo.fn_sqlvarbasetostr(СпрМст._IDRRef)        Мст,
	|   СпрМст._Description   имяМст,
	|   master.dbo.fn_sqlvarbasetostr(СпрЦО._IDRRef)        ЦО,
	|   СпрЦО._Description   имяЦО,
	|   СпрЦО._CODE          кодЦО,
	|   СпрЦО."+цоДоп+"      цоДоп,
	|   master.dbo.fn_sqlvarbasetostr(СпрЦОРод."+цоНом+")  цоНом,
	|   master.dbo.fn_sqlvarbasetostr(Док."+дкЦех+")  ЦехОтбора,
	|   ISNULL("+анЗн2+",'') ТекстДляПечати,
	|   SUM(ДокТЧ."+дкКМ+")   КМ,
	|   SUM(ДокТЧ."+дкКол+")  Час,
	|   SUM(ДокТЧ."+дкКолКм+")КолКм,
	|   SUM(ДокТЧ."+дкКол1+") Час1,
	|   SUM(ДокТЧ."+дкКол2+") Час2,
	|   SUM(ДокТЧ."+дкКол3+") Час3,
	|   SUM(ДокТЧ."+дкКол4+") Час4,
	|   SUM(ДокТЧ."+дкКол5+") Час5,
	|   SUM(ДокТЧ."+дкКол6+") Час6,
	|   SUM(ДокТЧ."+дкСУм+")  Сум,
	|   SUM(ДокТЧ."+дкСУмКм+") СумКм,
	|   SUM(ДокТЧ."+дкСУм1+") Сум1,
	|   SUM(ДокТЧ."+дкСУм2+") Сум2,
	|   SUM(ДокТЧ."+дкСУм3+") Сум3,
	|   SUM(ДокТЧ."+дкСУм4+") Сум4,
	|   SUM(ДокТЧ."+дкСУм5+") Сум5,
	|   SUM(ДокТЧ."+дкСУм6+") Сум6
	|
	| FROM "+Док+" Док
	| INNER JOIN   "+ДокТЧ+" ДокТЧ ON ДокТЧ."+ДокТЧидРеф+" = Док._IDRRef
	| INNER JOIN   "+СпрТС+" СпрТС ON СпрТС._IDRRef = "+дкТС+"
	| LEFT OUTER JOIN "+ДокПЛ+" ON "+ДокПЛ+"._IDRRef =  "+дкПЛ+"
	| LEFT OUTER JOIN "+СпрПодр+" СпрПодр ON (SELECT TOP 1 "+ргПодр+" FROM "+РегПодр+" WHERE "+ргТС+" = "+дкТС+" AND _Period <= ISNULL("+ДокПЛ+"."+плВзд+",Док._Date_Time) ORDER BY _Period desc) = СпрПодр._IDRRef
	| LEFT OUTER JOIN   "+СпрЦО+"  СпрЦО  ON СпрЦО._IDRRef  =  "+дкЦО+"
	| LEFT OUTER JOIN   "+СпрЦО+"  СпрЦОРод  ON СпрЦОРод._IDRRef  =  СпрЦО._ParentIDRRef
	| LEFT OUTER JOIN   "+СпрМст+" СпрМст ON СпрМст._IDRRef =  СпрЦО."+цоМст+"
	| LEFT OUTER JOIN   "+РегДопАн+" РегДопАн ON   РегДопАн."+анКА+" =  "+дкКА+"
	|                                          and РегДопАн."+анМод+" =  "+тсТип+"
	|
	| WHERE (LTRIM(RTRIM(Док._Number)) = '"+СокрЛП(ТекНом)+"' OR LTRIM(RTRIM(Док._Number)) = RIGHT('00000000'+'"+СокрЛП(ТекНом)+"',6) OR LTRIM(RTRIM(Док._Number)) = RIGHT('00000000'+'"+СокрЛП(ТекНом)+"',9)  OR 1 = "+ВсеДоки+" )
	|   AND Док._Date_Time >= Convert(DateTime,'"+Формат(Год(НачДт)+2000,"ЧГ=0")+""+Формат(НачДт,"ДФ=MMdd")+"')
	|   AND Док._Date_Time < Convert(DateTime,'"+Формат(Год(КонДт)+2000,"ЧГ=0")+""+Формат(КонДт,"ДФ=MMdd")+"')
	|   AND master.dbo.fn_sqlvarbasetostr("+дкКА+") <> '"+идНашКА+"'
	|
	| GROUP BY  
	|   Док._IDRRef,
	|   LTRIM(RTRIM(Док._Number)) ,
	|   Док._Date_Time,
	|    Док."+дкЦех+",
	|  	СпрТС."+тсГарНом+" ,
	|  	СпрТС._Description ,
	|  	"+дкКА+" ,
	|   СпрМст._IDRRef ,
	|   СпрМст._Description,
	|   СпрЦО._IDRRef,        
	|   СпрЦО._Description,   
	|   СпрЦО._CODE,
	|   СпрЦО."+цоДоп+",
	|   СпрЦОРод."+цоНом+",
	|   СпрПодр._IDRRef,        
	|   СпрПодр._CODE, 
	|   ISNULL("+анЗн2+",'')
	|"; 
	
	//Сообщить(ТекстЗапроса); //Возврат;	
	Соединение=Новый ComObject("ADODB.Connection");
	Соединение.Open(Константы.кcСтрокаSQLпроизводство.Получить());
	Записи=Новый ComObject("ADODB.RecordSet");
	Записи.Open(ТекстЗапроса,Соединение);
	

	
	пИдРее = "*?ЕНАПРИОЛЗХ_)(*?ЕНПРОИЛЬД";
	Пока Записи.EOF() = 0 Цикл 
		
		идРее = СокрлП(Записи.Fields("Ид").Value);
		
		Если пИдРее <> идРее ТОгда
			 пИдРее =  идРее;
			
			МасСтр = Тбл.НайтиСтроки(Новый Структура("ИдРеестра",идРее));
			Если МасСтр.Количество() > 0 Тогда
				ДЛя каждого стМас из МасСтр Цикл
					Тбл.Удалить(стМас);
				КонецЦикла;
			КонецеСЛИ;   
			
			ТекКА = ПолучитьКА(Записи.Fields("идКА").Value,ВсеДоки);
		КонецеСЛИ;
		
		
		Стр = Тбл.Добавить();
		стр.ИдРеестра  = идРее;
		
		стр.НомерРеестра = Записи.Fields("Ном").Value;
		стр.ДатаРеестра = Записи.Fields("Дт").Value;
		Стр.ДатаРеестра = Дата(Год(Стр.ДатаРеестра)-2000,Месяц(Стр.ДатаРеестра),День(Стр.ДатаРеестра));
		
		//Автомобиль
		Код = СокрЛП(Записи.Fields("КодТС").Value);
		Имя = СокрЛП(Записи.Fields("ИмяТС").Value);
		стр.основноеСредство = глГуид.глПолучитьОС(Код,Имя);
		стр.КодТС = Код;
		
		//Код = СокрЛП(Записи.Fields("КодПодр").Value);
		//сс = Справочники.ПодразделенияОрганизаций.НайтиПоКоду(Код);
		//Если СС.Пустая() Тогда
		//	Сообщить("Не найдено подразделение с кодом  "+Код);
		//КонецЕСЛИ;
		//стр.Подразделение = сс;
		Код = СокрЛП(Записи.Fields("Подр").Value);
		пПодр = глГУИД.ПолучитьСсылкуПоИдSQL(Код,"ПодразделенияОрганизаций");
		стр.Подразделение = глОбщий.глПолучитьНерасформированноеПодразделение(пПодр);
		Стр.НоменклатурнаяГруппа = Стр.Подразделение.ОсновнаяГруппаНоменклатуры;
		Если ЗначениеЗаполнено(Стр.НоменклатурнаяГруппа) = Ложь Тогда
			Стр.НоменклатурнаяГруппа = ТекНОмГруппа;
		КонецеслИ;
		
		
		//Месторождение
		идМст = Записи.Fields("Мст").Value;
		Имя = СокрЛП(Записи.Fields("ИмяМст").Value);
		Стр.Месторождение = глГуид.ПолучитьСсылкуПоИдSQL(идМст,"Месторождения",Неопределено,Имя);
		
		//Если ЗначениеЗаполнено(Стр.НоменклатурнаяГруппа) = Ложь Тогда
		//	Стр.НоменклатурнаяГруппа = ПолучитьМст(идМСт,Имя,ТекНОмГруппа);
		//КонецеслИ;
		
		//ЦехКонтрагента
		идЦО = СокрЛП(Записи.Fields("ЦО").Value);
		Имя = СокрЛП(Записи.Fields("ИмяЦО").Value);
		Код = СокрЛП(Записи.Fields("КодЦО").Value);
		Если идЦО<>"" ТОгда
			Стр.ЦО = глГуид.ПолучитьЦех(идЦО,Ложь,Истина,Имя,Код,Стр.НоменклатурнаяГруппа,ТекКА,Неопределено);
		КонецеСЛИ;
		
		//Номенклатура для печати
		идЦоНом = Записи.Fields("цоНом").Value;

		Стр.Номенклатура = глГуид.ПолучитьСсылкуПоИдSQL(идЦоНом,"Номенклатура");
		
		//ЦехОтбора
		идЦО = Записи.Fields("ЦехОтбора").Value;
		Стр.ЦехОтбора = Стр.ЦО;
		
		Стр.ТекстДляПечати = СокрЛП(Записи.Fields("ТекстДляПечати").Value)+" "+Записи.Fields("цоДоп").Value;
		
		Стр.Км   = Число(Записи.Fields("Км").Value);
		
		Стр.Часы   = Число(Записи.Fields("Час").Value);
		Стр.КолКм  = Число(Записи.Fields("КолКм").Value);
		Стр.Часы1  = Число(Записи.Fields("Час1").Value);
		Стр.Часы2  = Число(Записи.Fields("Час2").Value);
		Стр.Часы3  = Число(Записи.Fields("Час3").Value);
		Стр.Часы4  = Число(Записи.Fields("Час4").Value);
		Стр.Часы5  = Число(Записи.Fields("Час5").Value);
		Стр.Часы6  = Число(Записи.Fields("Час6").Value);
		
		Стр.Сум   = (Число(Записи.Fields("Сум").Value));
		Стр.СумКм = (Число(Записи.Fields("СумКм").Value));
		Стр.Сум1  = (Число(Записи.Fields("Сум1").Value));
		Стр.Сум2  = (Число(Записи.Fields("Сум2").Value));
		Стр.Сум3  = (Число(Записи.Fields("Сум3").Value));
		Стр.Сум4  = (Число(Записи.Fields("Сум4").Value));
		Стр.Сум5  = (Число(Записи.Fields("Сум5").Value));
		Стр.Сум6  = (Число(Записи.Fields("Сум6").Value));
		Стр.СуммаВсего = ОКР(Стр.Сум + Стр.СумКм + Стр.Сум1 + стр.Сум2 + Стр.Сум3 + Стр.Сум4 + Стр.Сум5 + Стр.Сум6,2,1);
		
		Записи.MoveNext(); 
	КонецЦикла; 
	
	Записи.Close(); 
	Соединение.Close(); 

	
КонецПроцедуры

Функция ДанныеСравнения(Дт,СткОбороты) Экспорт
	
	Состояние("Сбор данных из Производства");
	ТБл = Документы.КорректировкаРеализации.СоздатьДокумент().Реестр.Выгрузить();
	Данные("ВсеДоки",Дт,Тбл);
	Если СткОбороты<>Неопределено Тогда
		СткОбороты.СумПрз = Тбл.Итог("СуммаВсего");
	КонецЕСЛИ;
	
	Состояние("Сбор данных из Бухгалтерии");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ  * INTO ВРТбл FROM   &Тбл М;
				   |
				   |
				   |
				   |
				   |
				   |
				   |ВЫБРАТЬ
	               |	РеализацияТоваровУслугРеестр.ОсновноеСредство,
	               |	РеализацияТоваровУслугРеестр.ОсновноеСредство.Код КодТС,
	               |	РеализацияТоваровУслугРеестр.ЦО,
	               |	РеализацияТоваровУслугРеестр.НоменклатурнаяГруппа,
	               |	РеализацияТоваровУслугРеестр.Месторождение,
	               |	РеализацияТоваровУслугРеестр.Км,
	               |	РеализацияТоваровУслугРеестр.СуммаВсего,
	               |	РеализацияТоваровУслугРеестр.Сум,
	               |	РеализацияТоваровУслугРеестр.СумКм,
	               |	РеализацияТоваровУслугРеестр.Сум1,
	               |	РеализацияТоваровУслугРеестр.Сум2,
	               |	РеализацияТоваровУслугРеестр.Сум3,
	               |	РеализацияТоваровУслугРеестр.Сум4,
	               |	РеализацияТоваровУслугРеестр.Сум5,
	               |	РеализацияТоваровУслугРеестр.Сум6,
	               |	РеализацияТоваровУслугРеестр.НомерРеестра,
	               |	РеализацияТоваровУслугРеестр.идРеестра,
	               |	РеализацияТоваровУслугРеестр.Часы,
	               |	РеализацияТоваровУслугРеестр.КолКм,
	               |	РеализацияТоваровУслугРеестр.Часы1,
	               |	РеализацияТоваровУслугРеестр.Часы2,
	               |	РеализацияТоваровУслугРеестр.Часы3,
	               |	РеализацияТоваровУслугРеестр.Часы4,
	               |	РеализацияТоваровУслугРеестр.Часы5,
	               |	РеализацияТоваровУслугРеестр.Часы6,
	               |	РеализацияТоваровУслугРеестр.Подразделение,
				   |    ДокРее.Ссылка,
				   |    SUM(СумБух) СумБух,
				   |    SUM(СумПрз) СумПрз
				   |
				   |
				   |FROM (
				   |ВЫБРАТЬ
	               |	РеализацияТоваровУслугРеестр.ОсновноеСредство,
	               |	РеализацияТоваровУслугРеестр.КодТС,
	               |	РеализацияТоваровУслугРеестр.ЦО,
	               |	РеализацияТоваровУслугРеестр.НоменклатурнаяГруппа,
	               |	РеализацияТоваровУслугРеестр.Месторождение,
	               |	РеализацияТоваровУслугРеестр.Км,
	               |	РеализацияТоваровУслугРеестр.СуммаВсего,
	               |	РеализацияТоваровУслугРеестр.Сум,
	               |	РеализацияТоваровУслугРеестр.СумКм,
	               |	РеализацияТоваровУслугРеестр.Сум1,
	               |	РеализацияТоваровУслугРеестр.Сум2,
	               |	РеализацияТоваровУслугРеестр.Сум3,
	               |	РеализацияТоваровУслугРеестр.Сум4,
	               |	РеализацияТоваровУслугРеестр.Сум5,
	               |	РеализацияТоваровУслугРеестр.Сум6,
	               |	РеализацияТоваровУслугРеестр.НомерРеестра,
	               |	РеализацияТоваровУслугРеестр.идРеестра,
	               |	РеализацияТоваровУслугРеестр.Часы,
	               |	РеализацияТоваровУслугРеестр.КолКм,
	               |	РеализацияТоваровУслугРеестр.Часы1,
	               |	РеализацияТоваровУслугРеестр.Часы2,
	               |	РеализацияТоваровУслугРеестр.Часы3,
	               |	РеализацияТоваровУслугРеестр.Часы4,
	               |	РеализацияТоваровУслугРеестр.Часы5,
	               |	РеализацияТоваровУслугРеестр.Часы6,
	               |	РеализацияТоваровУслугРеестр.Подразделение,
				   |    РеализацияТоваровУслугРеестр.СуммаВсего СумБух,
				   |    0 СумПрз
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Реестр КАК РеализацияТоваровУслугРеестр
	               |ГДЕ (РеализацияТоваровУслугРеестр.Ссылка.Дата >= &Дт)
	               |			И (РеализацияТоваровУслугРеестр.Ссылка.Дата < &Дт1)
	               |			И (РеализацияТоваровУслугРеестр.Ссылка.проведен = истина)
				   |
				   |UNION ALL
				   |
				   |ВЫБРАТЬ
	               |	РеализацияТоваровУслугРеестр.ОсновноеСредство,
	               |	РеализацияТоваровУслугРеестр.КодТС,
	               |	РеализацияТоваровУслугРеестр.ЦО,
	               |	РеализацияТоваровУслугРеестр.НоменклатурнаяГруппа,
	               |	РеализацияТоваровУслугРеестр.Месторождение,
	               |	РеализацияТоваровУслугРеестр.Км,
	               |	РеализацияТоваровУслугРеестр.СуммаВсего,
	               |	РеализацияТоваровУслугРеестр.Сум,
	               |	РеализацияТоваровУслугРеестр.СумКм,
	               |	РеализацияТоваровУслугРеестр.Сум1,
	               |	РеализацияТоваровУслугРеестр.Сум2,
	               |	РеализацияТоваровУслугРеестр.Сум3,
	               |	РеализацияТоваровУслугРеестр.Сум4,
	               |	РеализацияТоваровУслугРеестр.Сум5,
	               |	РеализацияТоваровУслугРеестр.Сум6,
	               |	РеализацияТоваровУслугРеестр.НомерРеестра,
	               |	РеализацияТоваровУслугРеестр.идРеестра,
	               |	РеализацияТоваровУслугРеестр.Часы,
	               |	РеализацияТоваровУслугРеестр.КолКм,
	               |	РеализацияТоваровУслугРеестр.Часы1,
	               |	РеализацияТоваровУслугРеестр.Часы2,
	               |	РеализацияТоваровУслугРеестр.Часы3,
	               |	РеализацияТоваровУслугРеестр.Часы4,
	               |	РеализацияТоваровУслугРеестр.Часы5,
	               |	РеализацияТоваровУслугРеестр.Часы6,
	               |	РеализацияТоваровУслугРеестр.Подразделение,
				   |    РеализацияТоваровУслугРеестр.СуммаВсего СумБух,
				   |    0 СумПрз
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Реестр КАК РеализацияТоваровУслугРеестр
	               |ГДЕ (РеализацияТоваровУслугРеестр.Ссылка.Дата >= &Дт)
	               |			И (РеализацияТоваровУслугРеестр.Ссылка.Дата < &Дт1)
	               |			И (РеализацияТоваровУслугРеестр.Ссылка.проведен = истина)
				   |
				   |UNION ALL
				   |
				   |SELECT
	               |	РеализацияТоваровУслугРеестр.ОсновноеСредство,
	               |	РеализацияТоваровУслугРеестр.КодТС,
	               |	РеализацияТоваровУслугРеестр.ЦО,
	               |	РеализацияТоваровУслугРеестр.НоменклатурнаяГруппа,
	               |	РеализацияТоваровУслугРеестр.Месторождение,
	               |	SUM(РеализацияТоваровУслугРеестр.Км) Км,
	               |	SUM(РеализацияТоваровУслугРеестр.СуммаВсего)СуммаВсего,
	               |	SUM(РеализацияТоваровУслугРеестр.Сум)Сум,
	               |	SUM(РеализацияТоваровУслугРеестр.СумКм)СумКм,
	               |	SUM(РеализацияТоваровУслугРеестр.Сум1)Сум1,
	               |	SUM(РеализацияТоваровУслугРеестр.Сум2)Сум2,
	               |	SUM(РеализацияТоваровУслугРеестр.Сум3)Сум3,
	               |	SUM(РеализацияТоваровУслугРеестр.Сум4)Сум4,
	               |	SUM(РеализацияТоваровУслугРеестр.Сум5)Сум5,
	               |	SUM(РеализацияТоваровУслугРеестр.Сум6)Сум6,
	               |	РеализацияТоваровУслугРеестр.НомерРеестра,
	               |	РеализацияТоваровУслугРеестр.идРеестра,
	               |	SUM(РеализацияТоваровУслугРеестр.Часы)Часы,
	               |	SUM(РеализацияТоваровУслугРеестр.КолКм)КолКм,
	               |	SUM(РеализацияТоваровУслугРеестр.Часы1)Часы1,
	               |	SUM(РеализацияТоваровУслугРеестр.Часы2)Часы2,
	               |	SUM(РеализацияТоваровУслугРеестр.Часы3)Часы3,
	               |	SUM(РеализацияТоваровУслугРеестр.Часы4)Часы4,
	               |	SUM(РеализацияТоваровУслугРеестр.Часы5)Часы5,
	               |	SUM(РеализацияТоваровУслугРеестр.Часы6)Часы6,
	               |	РеализацияТоваровУслугРеестр.Подразделение,
				   |    0 СумБух,
				   |    SUM(СуммаВсего) СумПрз
	               |ИЗ
	               |	ВрТбл КАК РеализацияТоваровУслугРеестр
				   |GROUP BY
	               |	РеализацияТоваровУслугРеестр.ОсновноеСредство,
	               |	РеализацияТоваровУслугРеестр.КодТС,
	               |	РеализацияТоваровУслугРеестр.ЦО,
	               |	РеализацияТоваровУслугРеестр.НоменклатурнаяГруппа,
	               |	РеализацияТоваровУслугРеестр.Месторождение,
	               |	РеализацияТоваровУслугРеестр.НомерРеестра,
	               |	РеализацияТоваровУслугРеестр.идРеестра,
	               |	РеализацияТоваровУслугРеестр.Подразделение
				   |
				   |) РеализацияТоваровУслугРеестр
				   |LEFT OUTER JOIN (SELECT DISTINCT идРеестра, ссылка
				   |                  FROM Документ.РеализацияТоваровУслуг.Реестр ДокРее0
	               |                   ГДЕ (ДокРее0.Ссылка.Дата >= &Дт)
	               |			         И (ДокРее0.Ссылка.Дата < &Дт1)
	               |			         И (ДокРее0.Ссылка.проведен = истина)
				   |                 ) ДокРее ON ДокРее.идРеестра = РеализацияТоваровУслугРеестр.идРеестра
				   |
				   |GROUP BY 
	               |	РеализацияТоваровУслугРеестр.ОсновноеСредство,
	               |	РеализацияТоваровУслугРеестр.ОсновноеСредство.Код,
	               |	РеализацияТоваровУслугРеестр.ЦО,
	               |	РеализацияТоваровУслугРеестр.НоменклатурнаяГруппа,
	               |	РеализацияТоваровУслугРеестр.Месторождение,
	               |	РеализацияТоваровУслугРеестр.Км,
	               |	РеализацияТоваровУслугРеестр.СуммаВсего,
	               |	РеализацияТоваровУслугРеестр.Сум,
	               |	РеализацияТоваровУслугРеестр.СумКм,
	               |	РеализацияТоваровУслугРеестр.Сум1,
	               |	РеализацияТоваровУслугРеестр.Сум2,
	               |	РеализацияТоваровУслугРеестр.Сум3,
	               |	РеализацияТоваровУслугРеестр.Сум4,
	               |	РеализацияТоваровУслугРеестр.Сум5,
	               |	РеализацияТоваровУслугРеестр.Сум6,
	               |	РеализацияТоваровУслугРеестр.НомерРеестра,
	               |	РеализацияТоваровУслугРеестр.идРеестра,
	               |	РеализацияТоваровУслугРеестр.Часы,
	               |	РеализацияТоваровУслугРеестр.КолКм,
	               |	РеализацияТоваровУслугРеестр.Часы1,
	               |	РеализацияТоваровУслугРеестр.Часы2,
	               |	РеализацияТоваровУслугРеестр.Часы3,
	               |	РеализацияТоваровУслугРеестр.Часы4,
	               |	РеализацияТоваровУслугРеестр.Часы5,
	               |	РеализацияТоваровУслугРеестр.Часы6,
	               |	РеализацияТоваровУслугРеестр.Подразделение,
				   |    ДокРее.Ссылка
				   |
				   |HAVING SUM(СумБух)<>SUM(СумПрз)
				   |
				   |ORDER BY 
	               |	РеализацияТоваровУслугРеестр.НомерРеестра,
	               |	РеализацияТоваровУслугРеестр.идРеестра,
				   |    ДокРее.Ссылка,
	               |	РеализацияТоваровУслугРеестр.ОсновноеСредство
				   |
				   |
				   |";
				   
				   Запрос.УстановитьПараметр("Дт",НачалоМЕсяца(Дт));
				   Запрос.УстановитьПараметр("Дт1",КонецМЕсяца(Дт)+1);
				   Запрос.УстановитьПараметр("Тбл",Тбл);
				   
	   Возврат Запрос.Выполнить().Выгрузить();
	
   КонецФункции
